MikroElektronika/core_packages/PIC/XC8/def/PIC18F47J53/mcu.h
extern volatile DSGPR0bits_t DSGPR0bits __at(0xF4E);
// bitfield macros
#define _DSGPR0_DSGPR0_POSN                                 0x0
#define _DSGPR0_DSGPR0_POSITION                             0x0
#define _DSGPR0_DSGPR0_SIZE                                 0x8
#define _DSGPR0_DSGPR0_LENGTH                               0x8
#define _DSGPR0_DSGPR0_MASK                                 0xFF

// Register: DSGPR1
#define DSGPR1 DSGPR1
extern volatile unsigned char           DSGPR1              __at(0xF4F);
#ifndef _LIB_BUILD
asm("DSGPR1 equ 0F4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSGPR1                 :8;
    };
} DSGPR1bits_t;
extern volatile DSGPR1bits_t DSGPR1bits __at(0xF4F);
// bitfield macros
#define _DSGPR1_DSGPR1_POSN                                 0x0
#define _DSGPR1_DSGPR1_POSITION                             0x0
#define _DSGPR1_DSGPR1_SIZE                                 0x8
#define _DSGPR1_DSGPR1_LENGTH                               0x8
#define _DSGPR1_DSGPR1_MASK                                 0xFF

// Register: CCPTMRS2
#define CCPTMRS2 CCPTMRS2
extern volatile unsigned char           CCPTMRS2            __at(0xF50);
#ifndef _LIB_BUILD
asm("CCPTMRS2 equ 0F50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C8TSEL                 :2;
        unsigned C9TSEL0                :1;
        unsigned                        :1;
        unsigned C10TSEL0               :1;
    };
    struct {
        unsigned C8TSEL0                :1;
        unsigned C8TSEL1                :1;
    };
} CCPTMRS2bits_t;
extern volatile CCPTMRS2bits_t CCPTMRS2bits __at(0xF50);
// bitfield macros
#define _CCPTMRS2_C8TSEL_POSN                               0x0
#define _CCPTMRS2_C8TSEL_POSITION                           0x0
#define _CCPTMRS2_C8TSEL_SIZE                               0x2
#define _CCPTMRS2_C8TSEL_LENGTH                             0x2
#define _CCPTMRS2_C8TSEL_MASK                               0x3
#define _CCPTMRS2_C9TSEL0_POSN                              0x2
#define _CCPTMRS2_C9TSEL0_POSITION                          0x2
#define _CCPTMRS2_C9TSEL0_SIZE                              0x1
#define _CCPTMRS2_C9TSEL0_LENGTH                            0x1
#define _CCPTMRS2_C9TSEL0_MASK                              0x4
#define _CCPTMRS2_C10TSEL0_POSN                             0x4
#define _CCPTMRS2_C10TSEL0_POSITION                         0x4
#define _CCPTMRS2_C10TSEL0_SIZE                             0x1
#define _CCPTMRS2_C10TSEL0_LENGTH                           0x1
#define _CCPTMRS2_C10TSEL0_MASK                             0x10
#define _CCPTMRS2_C8TSEL0_POSN                              0x0
#define _CCPTMRS2_C8TSEL0_POSITION                          0x0
#define _CCPTMRS2_C8TSEL0_SIZE                              0x1
#define _CCPTMRS2_C8TSEL0_LENGTH                            0x1
#define _CCPTMRS2_C8TSEL0_MASK                              0x1
#define _CCPTMRS2_C8TSEL1_POSN                              0x1
#define _CCPTMRS2_C8TSEL1_POSITION                          0x1
#define _CCPTMRS2_C8TSEL1_SIZE                              0x1
#define _CCPTMRS2_C8TSEL1_LENGTH                            0x1
#define _CCPTMRS2_C8TSEL1_MASK                              0x2

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
extern volatile unsigned char           CCPTMRS1            __at(0xF51);
#ifndef _LIB_BUILD
asm("CCPTMRS1 equ 0F51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C4TSEL                 :2;
        unsigned C5TSEL0                :1;
        unsigned                        :1;
        unsigned C6TSEL0                :1;
        unsigned                        :1;
        unsigned C7TSEL                 :2;
    };
    struct {
        unsigned C4TSEL0                :1;
        unsigned C4TSEL1                :1;
        unsigned                        :4;
        unsigned C7TSEL0                :1;
        unsigned C7TSEL1                :1;
    };
} CCPTMRS1bits_t;
extern volatile CCPTMRS1bits_t CCPTMRS1bits __at(0xF51);
// bitfield macros
#define _CCPTMRS1_C4TSEL_POSN                               0x0
#define _CCPTMRS1_C4TSEL_POSITION                           0x0
#define _CCPTMRS1_C4TSEL_SIZE                               0x2
#define _CCPTMRS1_C4TSEL_LENGTH                             0x2
#define _CCPTMRS1_C4TSEL_MASK                               0x3
#define _CCPTMRS1_C5TSEL0_POSN                              0x2
#define _CCPTMRS1_C5TSEL0_POSITION                          0x2
#define _CCPTMRS1_C5TSEL0_SIZE                              0x1
#define _CCPTMRS1_C5TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C5TSEL0_MASK                              0x4
#define _CCPTMRS1_C6TSEL0_POSN                              0x4
#define _CCPTMRS1_C6TSEL0_POSITION                          0x4
#define _CCPTMRS1_C6TSEL0_SIZE                              0x1
#define _CCPTMRS1_C6TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C6TSEL0_MASK                              0x10
#define _CCPTMRS1_C7TSEL_POSN                               0x6
#define _CCPTMRS1_C7TSEL_POSITION                           0x6
#define _CCPTMRS1_C7TSEL_SIZE                               0x2
#define _CCPTMRS1_C7TSEL_LENGTH                             0x2
#define _CCPTMRS1_C7TSEL_MASK                               0xC0
#define _CCPTMRS1_C4TSEL0_POSN                              0x0
#define _CCPTMRS1_C4TSEL0_POSITION                          0x0
#define _CCPTMRS1_C4TSEL0_SIZE                              0x1
#define _CCPTMRS1_C4TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C4TSEL0_MASK                              0x1
#define _CCPTMRS1_C4TSEL1_POSN                              0x1
#define _CCPTMRS1_C4TSEL1_POSITION                          0x1
#define _CCPTMRS1_C4TSEL1_SIZE                              0x1
#define _CCPTMRS1_C4TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C4TSEL1_MASK                              0x2
#define _CCPTMRS1_C7TSEL0_POSN                              0x6
#define _CCPTMRS1_C7TSEL0_POSITION                          0x6
#define _CCPTMRS1_C7TSEL0_SIZE                              0x1
#define _CCPTMRS1_C7TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C7TSEL0_MASK                              0x40
#define _CCPTMRS1_C7TSEL1_POSN                              0x7
#define _CCPTMRS1_C7TSEL1_POSITION                          0x7
#define _CCPTMRS1_C7TSEL1_SIZE                              0x1
#define _CCPTMRS1_C7TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C7TSEL1_MASK                              0x80

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
extern volatile unsigned char           CCPTMRS0            __at(0xF52);
#ifndef _LIB_BUILD
asm("CCPTMRS0 equ 0F52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1TSEL                 :3;
        unsigned C2TSEL                 :3;
        unsigned C3TSEL                 :2;
    };
    struct {
        unsigned C1TSEL0                :1;
        unsigned C1TSEL1                :1;
        unsigned C1TSEL2                :1;
        unsigned C2TSEL0                :1;
        unsigned C2TSEL1                :1;
        unsigned C2TSEL2                :1;
        unsigned C3TSEL0                :1;
        unsigned C3TSEL1                :1;
    };
} CCPTMRS0bits_t;
extern volatile CCPTMRS0bits_t CCPTMRS0bits __at(0xF52);
// bitfield macros
#define _CCPTMRS0_C1TSEL_POSN                               0x0
#define _CCPTMRS0_C1TSEL_POSITION                           0x0
#define _CCPTMRS0_C1TSEL_SIZE                               0x3
#define _CCPTMRS0_C1TSEL_LENGTH                             0x3
#define _CCPTMRS0_C1TSEL_MASK                               0x7
#define _CCPTMRS0_C2TSEL_POSN                               0x3
#define _CCPTMRS0_C2TSEL_POSITION                           0x3
#define _CCPTMRS0_C2TSEL_SIZE                               0x3
#define _CCPTMRS0_C2TSEL_LENGTH                             0x3
#define _CCPTMRS0_C2TSEL_MASK                               0x38
#define _CCPTMRS0_C3TSEL_POSN                               0x6
#define _CCPTMRS0_C3TSEL_POSITION                           0x6
#define _CCPTMRS0_C3TSEL_SIZE                               0x2
#define _CCPTMRS0_C3TSEL_LENGTH                             0x2
#define _CCPTMRS0_C3TSEL_MASK                               0xC0
#define _CCPTMRS0_C1TSEL0_POSN                              0x0
#define _CCPTMRS0_C1TSEL0_POSITION                          0x0
#define _CCPTMRS0_C1TSEL0_SIZE                              0x1
#define _CCPTMRS0_C1TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL0_MASK                              0x1
#define _CCPTMRS0_C1TSEL1_POSN                              0x1
#define _CCPTMRS0_C1TSEL1_POSITION                          0x1
#define _CCPTMRS0_C1TSEL1_SIZE                              0x1
#define _CCPTMRS0_C1TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL1_MASK                              0x2
#define _CCPTMRS0_C1TSEL2_POSN                              0x2
#define _CCPTMRS0_C1TSEL2_POSITION                          0x2
#define _CCPTMRS0_C1TSEL2_SIZE                              0x1
#define _CCPTMRS0_C1TSEL2_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL2_MASK                              0x4
#define _CCPTMRS0_C2TSEL0_POSN                              0x3
#define _CCPTMRS0_C2TSEL0_POSITION                          0x3
#define _CCPTMRS0_C2TSEL0_SIZE                              0x1
#define _CCPTMRS0_C2TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL0_MASK                              0x8
#define _CCPTMRS0_C2TSEL1_POSN                              0x4
#define _CCPTMRS0_C2TSEL1_POSITION                          0x4
#define _CCPTMRS0_C2TSEL1_SIZE                              0x1
#define _CCPTMRS0_C2TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL1_MASK                              0x10
#define _CCPTMRS0_C2TSEL2_POSN                              0x5
#define _CCPTMRS0_C2TSEL2_POSITION                          0x5
#define _CCPTMRS0_C2TSEL2_SIZE                              0x1
#define _CCPTMRS0_C2TSEL2_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL2_MASK                              0x20
#define _CCPTMRS0_C3TSEL0_POSN                              0x6
#define _CCPTMRS0_C3TSEL0_POSITION                          0x6
#define _CCPTMRS0_C3TSEL0_SIZE                              0x1
#define _CCPTMRS0_C3TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C3TSEL0_MASK                              0x40
#define _CCPTMRS0_C3TSEL1_POSN                              0x7
#define _CCPTMRS0_C3TSEL1_POSITION                          0x7
#define _CCPTMRS0_C3TSEL1_SIZE                              0x1
#define _CCPTMRS0_C3TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C3TSEL1_MASK                              0x80

