MikroElektronika/core_packages/PIC/XC8/def/PIC18F47J53/mcu.h
extern volatile PORTCbits_t PORTCbits __at(0xF82);
// bitfield macros
#define _PORTC_RC0_POSN                                     0x0
#define _PORTC_RC0_POSITION                                 0x0
#define _PORTC_RC0_SIZE                                     0x1
#define _PORTC_RC0_LENGTH                                   0x1
#define _PORTC_RC0_MASK                                     0x1
#define _PORTC_RC1_POSN                                     0x1
#define _PORTC_RC1_POSITION                                 0x1
#define _PORTC_RC1_SIZE                                     0x1
#define _PORTC_RC1_LENGTH                                   0x1
#define _PORTC_RC1_MASK                                     0x2
#define _PORTC_RC2_POSN                                     0x2
#define _PORTC_RC2_POSITION                                 0x2
#define _PORTC_RC2_SIZE                                     0x1
#define _PORTC_RC2_LENGTH                                   0x1
#define _PORTC_RC2_MASK                                     0x4
#define _PORTC_RC4_POSN                                     0x4
#define _PORTC_RC4_POSITION                                 0x4
#define _PORTC_RC4_SIZE                                     0x1
#define _PORTC_RC4_LENGTH                                   0x1
#define _PORTC_RC4_MASK                                     0x10
#define _PORTC_RC5_POSN                                     0x5
#define _PORTC_RC5_POSITION                                 0x5
#define _PORTC_RC5_SIZE                                     0x1
#define _PORTC_RC5_LENGTH                                   0x1
#define _PORTC_RC5_MASK                                     0x20
#define _PORTC_RC6_POSN                                     0x6
#define _PORTC_RC6_POSITION                                 0x6
#define _PORTC_RC6_SIZE                                     0x1
#define _PORTC_RC6_LENGTH                                   0x1
#define _PORTC_RC6_MASK                                     0x40
#define _PORTC_RC7_POSN                                     0x7
#define _PORTC_RC7_POSITION                                 0x7
#define _PORTC_RC7_SIZE                                     0x1
#define _PORTC_RC7_LENGTH                                   0x1
#define _PORTC_RC7_MASK                                     0x80
#define _PORTC_T1OSO_POSN                                   0x0
#define _PORTC_T1OSO_POSITION                               0x0
#define _PORTC_T1OSO_SIZE                                   0x1
#define _PORTC_T1OSO_LENGTH                                 0x1
#define _PORTC_T1OSO_MASK                                   0x1
#define _PORTC_T1OSI_POSN                                   0x1
#define _PORTC_T1OSI_POSITION                               0x1
#define _PORTC_T1OSI_SIZE                                   0x1
#define _PORTC_T1OSI_LENGTH                                 0x1
#define _PORTC_T1OSI_MASK                                   0x2
#define _PORTC_AN11_POSN                                    0x2
#define _PORTC_AN11_POSITION                                0x2
#define _PORTC_AN11_SIZE                                    0x1
#define _PORTC_AN11_LENGTH                                  0x1
#define _PORTC_AN11_MASK                                    0x4
#define _PORTC_D_MINUS_POSN                                 0x4
#define _PORTC_D_MINUS_POSITION                             0x4
#define _PORTC_D_MINUS_SIZE                                 0x1
#define _PORTC_D_MINUS_LENGTH                               0x1
#define _PORTC_D_MINUS_MASK                                 0x10
#define _PORTC_D_PLUS_POSN                                  0x5
#define _PORTC_D_PLUS_POSITION                              0x5
#define _PORTC_D_PLUS_SIZE                                  0x1
#define _PORTC_D_PLUS_LENGTH                                0x1
#define _PORTC_D_PLUS_MASK                                  0x20
#define _PORTC_PMA5_POSN                                    0x6
#define _PORTC_PMA5_POSITION                                0x6
#define _PORTC_PMA5_SIZE                                    0x1
#define _PORTC_PMA5_LENGTH                                  0x1
#define _PORTC_PMA5_MASK                                    0x40
#define _PORTC_PMA4_POSN                                    0x7
#define _PORTC_PMA4_POSITION                                0x7
#define _PORTC_PMA4_SIZE                                    0x1
#define _PORTC_PMA4_LENGTH                                  0x1
#define _PORTC_PMA4_MASK                                    0x80
#define _PORTC_NOT_UOE_POSN                                 0x1
#define _PORTC_NOT_UOE_POSITION                             0x1
#define _PORTC_NOT_UOE_SIZE                                 0x1
#define _PORTC_NOT_UOE_LENGTH                               0x1
#define _PORTC_NOT_UOE_MASK                                 0x2
#define _PORTC_T1CKI_POSN                                   0x0
#define _PORTC_T1CKI_POSITION                               0x0
#define _PORTC_T1CKI_SIZE                                   0x1
#define _PORTC_T1CKI_LENGTH                                 0x1
#define _PORTC_T1CKI_MASK                                   0x1
#define _PORTC_nUOE_POSN                                    0x1
#define _PORTC_nUOE_POSITION                                0x1
#define _PORTC_nUOE_SIZE                                    0x1
#define _PORTC_nUOE_LENGTH                                  0x1
#define _PORTC_nUOE_MASK                                    0x2
#define _PORTC_CTPLS_POSN                                   0x2
#define _PORTC_CTPLS_POSITION                               0x2
#define _PORTC_CTPLS_SIZE                                   0x1
#define _PORTC_CTPLS_LENGTH                                 0x1
#define _PORTC_CTPLS_MASK                                   0x4
#define _PORTC_VM_POSN                                      0x4
#define _PORTC_VM_POSITION                                  0x4
#define _PORTC_VM_SIZE                                      0x1
#define _PORTC_VM_LENGTH                                    0x1
#define _PORTC_VM_MASK                                      0x10
#define _PORTC_VP_POSN                                      0x5
#define _PORTC_VP_POSITION                                  0x5
#define _PORTC_VP_SIZE                                      0x1
#define _PORTC_VP_LENGTH                                    0x1
#define _PORTC_VP_MASK                                      0x20
#define _PORTC_TX1_POSN                                     0x6
#define _PORTC_TX1_POSITION                                 0x6
#define _PORTC_TX1_SIZE                                     0x1
#define _PORTC_TX1_LENGTH                                   0x1
#define _PORTC_TX1_MASK                                     0x40
#define _PORTC_RX1_POSN                                     0x7
#define _PORTC_RX1_POSITION                                 0x7
#define _PORTC_RX1_SIZE                                     0x1
#define _PORTC_RX1_LENGTH                                   0x1
#define _PORTC_RX1_MASK                                     0x80
#define _PORTC_RP11_POSN                                    0x0
#define _PORTC_RP11_POSITION                                0x0
#define _PORTC_RP11_SIZE                                    0x1
#define _PORTC_RP11_LENGTH                                  0x1
#define _PORTC_RP11_MASK                                    0x1
#define _PORTC_RP12_POSN                                    0x1
#define _PORTC_RP12_POSITION                                0x1
#define _PORTC_RP12_SIZE                                    0x1
#define _PORTC_RP12_LENGTH                                  0x1
#define _PORTC_RP12_MASK                                    0x2
#define _PORTC_RP13_POSN                                    0x2
#define _PORTC_RP13_POSITION                                0x2
#define _PORTC_RP13_SIZE                                    0x1
#define _PORTC_RP13_LENGTH                                  0x1
#define _PORTC_RP13_MASK                                    0x4
#define _PORTC_CK1_POSN                                     0x6
#define _PORTC_CK1_POSITION                                 0x6
#define _PORTC_CK1_SIZE                                     0x1
#define _PORTC_CK1_LENGTH                                   0x1
#define _PORTC_CK1_MASK                                     0x40
#define _PORTC_DT1_POSN                                     0x7
#define _PORTC_DT1_POSITION                                 0x7
#define _PORTC_DT1_SIZE                                     0x1
#define _PORTC_DT1_LENGTH                                   0x1
#define _PORTC_DT1_MASK                                     0x80
#define _PORTC_RP17_POSN                                    0x6
#define _PORTC_RP17_POSITION                                0x6
#define _PORTC_RP17_SIZE                                    0x1
#define _PORTC_RP17_LENGTH                                  0x1
#define _PORTC_RP17_MASK                                    0x40
#define _PORTC_SDO1_POSN                                    0x7
#define _PORTC_SDO1_POSITION                                0x7
#define _PORTC_SDO1_SIZE                                    0x1
#define _PORTC_SDO1_LENGTH                                  0x1
#define _PORTC_SDO1_MASK                                    0x80
#define _PORTC_C2IND_POSN                                   0x2
#define _PORTC_C2IND_POSITION                               0x2
#define _PORTC_C2IND_SIZE                                   0x1
#define _PORTC_C2IND_LENGTH                                 0x1
#define _PORTC_C2IND_MASK                                   0x4
#define _PORTC_RP18_POSN                                    0x7
#define _PORTC_RP18_POSITION                                0x7
#define _PORTC_RP18_SIZE                                    0x1
#define _PORTC_RP18_LENGTH                                  0x1
#define _PORTC_RP18_MASK                                    0x80
#define _PORTC_CCP8_POSN                                    0x1
#define _PORTC_CCP8_POSITION                                0x1
#define _PORTC_CCP8_SIZE                                    0x1
#define _PORTC_CCP8_LENGTH                                  0x1
#define _PORTC_CCP8_MASK                                    0x2
#define _PORTC_CCP9_POSN                                    0x6
#define _PORTC_CCP9_POSITION                                0x6
#define _PORTC_CCP9_SIZE                                    0x1
#define _PORTC_CCP9_LENGTH                                  0x1
#define _PORTC_CCP9_MASK                                    0x40
#define _PORTC_CCP10_POSN                                   0x7
#define _PORTC_CCP10_POSITION                               0x7
#define _PORTC_CCP10_SIZE                                   0x1
#define _PORTC_CCP10_LENGTH                                 0x1
#define _PORTC_CCP10_MASK                                   0x80
#define _PORTC_CCP2_POSN                                    0x1
#define _PORTC_CCP2_POSITION                                0x1
#define _PORTC_CCP2_SIZE                                    0x1
#define _PORTC_CCP2_LENGTH                                  0x1
#define _PORTC_CCP2_MASK                                    0x2
#define _PORTC_PA1_POSN                                     0x2
#define _PORTC_PA1_POSITION                                 0x2
#define _PORTC_PA1_SIZE                                     0x1
#define _PORTC_PA1_LENGTH                                   0x1
#define _PORTC_PA1_MASK                                     0x4
#define _PORTC_PA2_POSN                                     0x1
#define _PORTC_PA2_POSITION                                 0x1
#define _PORTC_PA2_SIZE                                     0x1
#define _PORTC_PA2_LENGTH                                   0x1
#define _PORTC_PA2_MASK                                     0x2

