MikroElektronika/core_packages/PIC/XC8/def/PIC18F47J53/mcu.h
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0x7CAE);	// @ (0xF95 * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0x7CAF);	// @ (0xF95 * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0x7CB0);	// @ (0xF96 * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0x7CB1);	// @ (0xF96 * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0x7CB2);	// @ (0xF96 * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// TXSTA1<TRMT1>
extern volatile __bit                   TRMT1               __at(0x7D69);	// @ (0xFAD * 8 + 1)
#define                                 TRMT1_bit           _BIT_ACCESS(TXSTA1,1)
// TXSTA2<TRMT2>
extern volatile __bit                   TRMT2               __at(0x7D41);	// @ (0xFA8 * 8 + 1)
#define                                 TRMT2_bit           _BIT_ACCESS(TXSTA2,1)
// UIE<TRNIE>
extern volatile __bit                   TRNIE               __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 TRNIE_bit           _BIT_ACCESS(UIE,3)
// UIR<TRNIF>
extern volatile __bit                   TRNIF               __at(0x7B13);	// @ (0xF62 * 8 + 3)
#define                                 TRNIF_bit           _BIT_ACCESS(UIR,3)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x7CD8);	// @ (0xF9B * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x7CD9);	// @ (0xF9B * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x7CDA);	// @ (0xF9B * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x7CDB);	// @ (0xF9B * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x7CDC);	// @ (0xF9B * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x7CDD);	// @ (0xF9B * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// PORTC<TX1>
extern volatile __bit                   TX1                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 TX1_bit             _BIT_ACCESS(PORTC,6)
// PIE1<TX1IE>
extern volatile __bit                   TX1IE               __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE1,4)
// PIR1<TX1IF>
extern volatile __bit                   TX1IF               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR1,4)
// IPR1<TX1IP>
extern volatile __bit                   TX1IP               __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TX1IP_bit           _BIT_ACCESS(IPR1,4)
// PIE3<TX2IE>
extern volatile __bit                   TX2IE               __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TX2IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX2IF>
extern volatile __bit                   TX2IF               __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TX2IF_bit           _BIT_ACCESS(PIR3,4)
// IPR3<TX2IP>
extern volatile __bit                   TX2IP               __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TX2IP_bit           _BIT_ACCESS(IPR3,4)
// TXSTA1<TX8_9>
extern volatile __bit                   TX8_9               __at(0x7D6E);	// @ (0xFAD * 8 + 6)
#define                                 TX8_9_bit           _BIT_ACCESS(TXSTA1,6)
// TXSTA2<TX8_92>
extern volatile __bit                   TX8_92              __at(0x7D46);	// @ (0xFA8 * 8 + 6)
#define                                 TX8_92_bit          _BIT_ACCESS(TXSTA2,6)
// TXSTA1<TX91>
extern volatile __bit                   TX91                __at(0x7D6E);	// @ (0xFAD * 8 + 6)
#define                                 TX91_bit            _BIT_ACCESS(TXSTA1,6)
// TXSTA2<TX92>
extern volatile __bit                   TX92                __at(0x7D46);	// @ (0xFA8 * 8 + 6)
#define                                 TX92_bit            _BIT_ACCESS(TXSTA2,6)
// TXSTA1<TX9D1>
extern volatile __bit                   TX9D1               __at(0x7D68);	// @ (0xFAD * 8 + 0)
#define                                 TX9D1_bit           _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TX9D2>
extern volatile __bit                   TX9D2               __at(0x7D40);	// @ (0xFA8 * 8 + 0)
#define                                 TX9D2_bit           _BIT_ACCESS(TXSTA2,0)
// PIE3<TXB0IE>
extern volatile __bit                   TXB0IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 TXB0IE_bit          _BIT_ACCESS(PIE3,2)
// PIE3<TXB1IE>
extern volatile __bit                   TXB1IE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 TXB1IE_bit          _BIT_ACCESS(PIE3,3)
// PIE3<TXB2IE>
extern volatile __bit                   TXB2IE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXB2IE_bit          _BIT_ACCESS(PIE3,4)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// BAUDCON1<TXCKP1>
extern volatile __bit                   TXCKP1              __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 TXCKP1_bit          _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<TXCKP2>
extern volatile __bit                   TXCKP2              __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 TXCKP2_bit          _BIT_ACCESS(BAUDCON2,4)
// TXSTA1<TXD8>
extern volatile __bit                   TXD8                __at(0x7D68);	// @ (0xFAD * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TXD82>
extern volatile __bit                   TXD82               __at(0x7D40);	// @ (0xFA8 * 8 + 0)
#define                                 TXD82_bit           _BIT_ACCESS(TXSTA2,0)
// TXSTA1<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7D6D);	// @ (0xFAD * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA1,5)
// TXSTA2<TXEN2>
extern volatile __bit                   TXEN2               __at(0x7D45);	// @ (0xFA8 * 8 + 5)
#define                                 TXEN2_bit           _BIT_ACCESS(TXSTA2,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// DMACON1<TXINC>
extern volatile __bit                   TXINC               __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 TXINC_bit           _BIT_ACCESS(DMACON1,5)
// IPR1<TXIP>
extern volatile __bit                   TXIP                __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR1,4)
// ODCON2<U1OD>
extern volatile __bit                   U1OD                __at(0x7A08);	// @ (0xF41 * 8 + 0)
#define                                 U1OD_bit            _BIT_ACCESS(ODCON2,0)
// ODCON2<U2OD>
extern volatile __bit                   U2OD                __at(0x7A09);	// @ (0xF41 * 8 + 1)
#define                                 U2OD_bit            _BIT_ACCESS(ODCON2,1)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// SSP2STAT<UA2>
extern volatile __bit                   UA2                 __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 UA2_bit             _BIT_ACCESS(SSP2STAT,1)
// PMDIS0<UART1MD>
extern volatile __bit                   UART1MD             __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 UART1MD_bit         _BIT_ACCESS(PMDIS0,3)
// PMDIS0<UART2MD>
extern volatile __bit                   UART2MD             __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 UART2MD_bit         _BIT_ACCESS(PMDIS0,4)
// UIE<UERRIE>
extern volatile __bit                   UERRIE              __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 UERRIE_bit          _BIT_ACCESS(UIE,1)
// UIR<UERRIF>
extern volatile __bit                   UERRIF              __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 UERRIF_bit          _BIT_ACCESS(UIR,1)
// WDTCON<ULPEN>
extern volatile __bit                   ULPEN               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ULPEN_bit           _BIT_ACCESS(WDTCON,2)
// WDTCON<ULPLVL>
extern volatile __bit                   ULPLVL              __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 ULPLVL_bit          _BIT_ACCESS(WDTCON,5)
// WDTCON<ULPSINK>
extern volatile __bit                   ULPSINK             __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 ULPSINK_bit         _BIT_ACCESS(WDTCON,1)
// DSCONL<ULPWDIS>
extern volatile __bit                   ULPWDIS             __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 ULPWDIS_bit         _BIT_ACCESS(DSCONL,2)
// PORTA<ULPWU>
extern volatile __bit                   ULPWU               __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWU_bit           _BIT_ACCESS(PORTA,0)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// UCFG<UOEMON>
extern volatile __bit                   UOEMON              __at(0x79CE);	// @ (0xF39 * 8 + 6)
#define                                 UOEMON_bit          _BIT_ACCESS(UCFG,6)
// UCFG<UPP0>
extern volatile __bit                   UPP0                __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 UPP0_bit            _BIT_ACCESS(UCFG,0)
// UCFG<UPP1>
extern volatile __bit                   UPP1                __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 UPP1_bit            _BIT_ACCESS(UCFG,1)
// UCFG<UPUEN>
extern volatile __bit                   UPUEN               __at(0x79CC);	// @ (0xF39 * 8 + 4)
#define                                 UPUEN_bit           _BIT_ACCESS(UCFG,4)
// UIE<URSTIE>
extern volatile __bit                   URSTIE              __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 URSTIE_bit          _BIT_ACCESS(UIE,0)
// UIR<URSTIF>
extern volatile __bit                   URSTIF              __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 URSTIF_bit          _BIT_ACCESS(UIR,0)
// UCON<USBEN>
extern volatile __bit                   USBEN               __at(0x7B2B);	// @ (0xF65 * 8 + 3)
#define                                 USBEN_bit           _BIT_ACCESS(UCON,3)
// PIE2<USBIE>
extern volatile __bit                   USBIE               __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 USBIE_bit           _BIT_ACCESS(PIE2,4)
// PIR2<USBIF>
extern volatile __bit                   USBIF               __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 USBIF_bit           _BIT_ACCESS(PIR2,4)
// IPR2<USBIP>
extern volatile __bit                   USBIP               __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 USBIP_bit           _BIT_ACCESS(IPR2,4)
// UCFG<UTEYE>
extern volatile __bit                   UTEYE               __at(0x79CF);	// @ (0xF39 * 8 + 7)
#define                                 UTEYE_bit           _BIT_ACCESS(UCFG,7)
// UCFG<UTRDIS>
extern volatile __bit                   UTRDIS              __at(0x79CB);	// @ (0xF39 * 8 + 3)
#define                                 UTRDIS_bit          _BIT_ACCESS(UCFG,3)
// PORTA<VBG>
extern volatile __bit                   VBG                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 VBG_bit             _BIT_ACCESS(PORTA,1)
// ANCON1<VBGEN>
extern volatile __bit                   VBGEN               __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 VBGEN_bit           _BIT_ACCESS(ANCON1,7)
// WDTCON<VBGOE>
extern volatile __bit                   VBGOE               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 VBGOE_bit           _BIT_ACCESS(WDTCON,4)
// ADCON0<VCFG0>
extern volatile __bit                   VCFG0               __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 VCFG0_bit           _BIT_ACCESS(ADCON0,6)
// ADCON1<VCFG01>
extern volatile __bit                   VCFG01              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG01_bit          _BIT_ACCESS(ADCON1,4)
// ADCON0<VCFG1>
extern volatile __bit                   VCFG1               __at(0x7E17);	// @ (0xFC2 * 8 + 7)
#define                                 VCFG1_bit           _BIT_ACCESS(ADCON0,7)
// ADCON1<VCFG11>
extern volatile __bit                   VCFG11              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG11_bit          _BIT_ACCESS(ADCON1,5)
// HLVDCON<VDIRMAG>
extern volatile __bit                   VDIRMAG             __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 VDIRMAG_bit         _BIT_ACCESS(HLVDCON,7)
// PORTC<VM>
extern volatile __bit                   VM                  __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 VM_bit              _BIT_ACCESS(PORTC,4)
// PORTB<VMO>
extern volatile __bit                   VMO                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 VMO_bit             _BIT_ACCESS(PORTB,2)
// PORTC<VP>
extern volatile __bit                   VP                  __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 VP_bit              _BIT_ACCESS(PORTC,5)
// PORTB<VPO>
extern volatile __bit                   VPO                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 VPO_bit             _BIT_ACCESS(PORTB,3)
// PORTA<VREF_MINUS>
extern volatile __bit                   VREF_MINUS          __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 VREF_MINUS_bit      _BIT_ACCESS(PORTA,2)
// PORTA<VREF_PLUS>
extern volatile __bit                   VREF_PLUS           __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 VREF_PLUS_bit       _BIT_ACCESS(PORTA,3)
// BAUDCON1<W4E>
extern volatile __bit                   W4E                 __at(0x7BF1);	// @ (0xF7E * 8 + 1)
#define                                 W4E_bit             _BIT_ACCESS(BAUDCON1,1)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(PR2,4)
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(PR2,5)
// PMMODEL<WAITB0>
extern volatile __bit _DEPRECATED       WAITB0              __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 WAITB0_bit          _BIT_ACCESS(PMMODEL,6)
// PMMODEL<WAITB1>
extern volatile __bit _DEPRECATED       WAITB1              __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 WAITB1_bit          _BIT_ACCESS(PMMODEL,7)
// PMMODEL<WAITE0>
extern volatile __bit _DEPRECATED       WAITE0              __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 WAITE0_bit          _BIT_ACCESS(PMMODEL,0)
// PMMODEL<WAITE1>
extern volatile __bit _DEPRECATED       WAITE1              __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 WAITE1_bit          _BIT_ACCESS(PMMODEL,1)
// PMMODEL<WAITM0>
extern volatile __bit _DEPRECATED       WAITM0              __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 WAITM0_bit          _BIT_ACCESS(PMMODEL,2)
// PMMODEL<WAITM1>
extern volatile __bit _DEPRECATED       WAITM1              __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 WAITM1_bit          _BIT_ACCESS(PMMODEL,3)
// PMMODEL<WAITM2>
extern volatile __bit _DEPRECATED       WAITM2              __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 WAITM2_bit          _BIT_ACCESS(PMMODEL,4)
// PMMODEL<WAITM3>
extern volatile __bit _DEPRECATED       WAITM3              __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 WAITM3_bit          _BIT_ACCESS(PMMODEL,5)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// SSP2CON1<WCOL2>
extern volatile __bit                   WCOL2               __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 WCOL2_bit           _BIT_ACCESS(SSP2CON1,7)
// PR2<WM0>
extern volatile __bit                   WM0                 __at(0x7E58);	// @ (0xFCB * 8 + 0)
#define                                 WM0_bit             _BIT_ACCESS(PR2,0)
// PR2<WM1>
extern volatile __bit                   WM1                 __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 WM1_bit             _BIT_ACCESS(PR2,1)
// EECON1<WPROG>
extern volatile __bit                   WPROG               __at(0x7D35);	// @ (0xFA6 * 8 + 5)
#define                                 WPROG_bit           _BIT_ACCESS(EECON1,5)
// EECON1<WR>
extern volatile __bit                   WR                  __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON1,1)
// PORTE<WRE>
extern volatile __bit                   WRE                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 WRE_bit             _BIT_ACCESS(PORTE,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7D32);	// @ (0xFA6 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7D33);	// @ (0xFA6 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// PMCONL<WRSP>
extern volatile __bit                   WRSP                __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 WRSP_bit            _BIT_ACCESS(PMCONL,1)
// BAUDCON1<WUE1>
extern volatile __bit                   WUE1                __at(0x7BF1);	// @ (0xF7E * 8 + 1)
#define                                 WUE1_bit            _BIT_ACCESS(BAUDCON1,1)
// BAUDCON2<WUE2>
extern volatile __bit                   WUE2                __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 WUE2_bit            _BIT_ACCESS(BAUDCON2,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSP1STAT<nA>
extern volatile __bit                   nA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<nA2>
extern volatile __bit                   nA2                 __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 nA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<nADDRESS>
extern volatile __bit                   nADDRESS            __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nADDRESS_bit        _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<nADDRESS2>
extern volatile __bit                   nADDRESS2           __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 nADDRESS2_bit       _BIT_ACCESS(SSP2STAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// RCON<nCM>
extern volatile __bit                   nCM                 __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 nCM_bit             _BIT_ACCESS(RCON,5)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// RCSTA1<nRC8>
extern volatile __bit                   nRC8                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 nRC8_bit            _BIT_ACCESS(RCSTA1,6)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// PORTA<nSS1>
extern volatile __bit                   nSS1                __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 nSS1_bit            _BIT_ACCESS(PORTA,5)
// T1GCON<nT1DONE>
extern volatile __bit                   nT1DONE             __at(0x7CD3);	// @ (0xF9A * 8 + 3)
#define                                 nT1DONE_bit         _BIT_ACCESS(T1GCON,3)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3GCON<nT3DONE>
extern volatile __bit                   nT3DONE             __at(0x7CBB);	// @ (0xF97 * 8 + 3)
#define                                 nT3DONE_bit         _BIT_ACCESS(T3GCON,3)
// T3CON<nT3SYNC>
